#pragma once


#include "resource.h"




//-------------------------------------------//
//1초에 한 번 모니터링 화면 출력, LogQ에 로그가 들어있다면 로그로 저장
// Frame이 떨어지면 모니터링 화면 로그로 저장
//-------------------------------------------//
unsigned int __stdcall LogThread(void*);
//-------------------------------------------//
//모니터링 출력
//-------------------------------------------//
void PrintLog();

//-------------------------------------------//
//프레임이 FrameError 값 이하로 떨어졌을 때 모니터링 되는 화면을 로그로 저장
//-------------------------------------------//
void WriteLog();
//-------------------------------------------//
//LogQ에서 뽑아서 로그로 저장
//-------------------------------------------//
void WriteLogQToFile();

//-------------------------------------------//
//파일 이름을 xxx.cpp로 남겨줌
//-------------------------------------------//
std::string getFileName(const std::string& path);